import React from "react";
import { styled } from "styled-components";

function provision() {
  return (
    <Container>
      <Wrapper>
        <h1>PROVISION</h1>
        <ProvisionBox>
          <h3>제1조 목적 </h3>
          <div>
            이 약관은 ㈜패션플러스 이하 "회사"라 합니다 가 운영하는 패션플러스
            몰 fashionplus.co.kr, 이하 "몰"이라 합니다 에서 제공하는 인터넷 관련
            서비스이하 "서비스"라 합니다를 이용함에 있어 이용조건 및 이용자의
            권리·의무 및 책임사항과 기타 필요한 사항을 규정함을 목적으로 합니다.
            ※「PC통신, 모바일, 무선 등을 이용하는 전자거래에 대해서도 그 성질에
            반하지 않는 한 이 약관을 준용합니다.」
          </div>
          <br />
          <h3>제2조 정의</h3>
          <div>
            1. "몰" 이란 회사가 재화 또는 용역을 이용자에게 제공하기 위하여
            컴퓨터 등 정보통신설비를 이용하여 재화 또는 용역을 거래할 수 있도록
            설정한 가상의 영업장을 말하며, 아울러 사이버몰을 운영하는 사업자의
            의미로도 사용합니다. 2. "이용자"란 "몰"에 접속하여 이 약관에 따라
            "몰"이 제공하는 서비스를 받는 회원 및 비회원을 말합니다. 3.
            "회원"이라 함은 "몰"에 개인정보를 제공하여 회원등록을 한 자로서,
            "몰"의 정보를 지속적으로 제공받으며, "몰"이 제공하는 서비스를
            계속적으로 이용할 수 있는 자를 말합니다. 4. "비회원"이라 함은 회원에
            가입하지 않고 "몰"이 제공하는 서비스를 이용하는 자를 말합니다.
          </div>
          <br />
          <h3>제3조 약관의 명시와 설명 및 개정</h3>
          <div>
            1. "몰"은 이 약관의 내용과 상호, 영업소 소재지, 대표자의 성명,
            사업자등록번호, 통신판매업 신고 등록번호, 연락처 전화, 팩스,
            전자우편 주소 등 등을 이용자가 알 수 있도록 "몰"의 초기 서비스화면
            전면에 게시합니다. 다만, 약관의 내용은 이용자가 연결화면을 통하여 볼
            수 있도록 할 수 있습니다. 2. "몰"은 이용자가 약관에 동의하기에 앞서
            약관에 정하여져 있는 내용 중 청약철회, 배송책임, 환불조건 등과 같은
            중요한 내용을 이용자가 이해할 수 있도록 별도의 연결화면 또는
            팝업화면 등을 제공하여 이용자의 확인을 구하여야 합니다. 3. "회사"는
            전자상거래등에서의소비자보호에관한법률, 약관의규제에관한법률,
            전자거래기본법, 전자서명법,정보통신망이용촉진 및 정보보호 등에 관한
            법률, 방문판매 등에 관한 법률, 소비자보호법 등 관련법을 위배하지
            않는 범위에서 이 약관을 개정할 수 있습니다. 4. "회사"는 약관을
            개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께
            "몰"의 초기화면에 그 적용일 7일 이전부터 적용일자 전일까지
            공지합니다. 5. "몰"이 약관을 개정할 경우에는 그 개정약관은 그
            적용일자 이후에 체결되는 계약에만 적용되고 그 이전에 이미 체결된
            계약에 대해서는 개정전의 약관조항이 그대로 적용됩니다. 다만 이미
            계약을 체결한 이용자가 개정약관 조항의 적용을 받기를 원하는 뜻을
            제3항에 의한 개정약관의 공지기간내에 "몰"에 송신하여 "몰"의 동의를
            받은 경우에는 개정약관 조항이 적용됩니다. 6. 이 약관에서 정하지
            아니한 내용과 이 약관의 해석에 관하여는
            전자상거래등에서의소비자보호에관한법률, 약관의규제등에관한법률,
            공정거래위원회가 정하는 전자상거래등에서의소비자보호지침 및 관계법령
            또는 상관례에 따릅니다.
          </div>
          <br />
          <h3>제4조 서비스의 제공 및 변경</h3>
          <div>
            1. "몰"은 다음과 같은 업무를 수행합니다. 1 재화 또는 용역에 대한
            정보 제공 및 구매계약의 체결 2 구매계약이 체결된 재화 또는 용역의
            배송 3 기타 "몰"이 정하는 업무 2. "몰"은 상품 또는 용역이 품절되거나
            기술적 사양의 변경 등으로 더 이상 제공할 수 없는 경우에는 장차
            체결되는 계약에 의해 제공할 상품·용역의 내용을 변경할 수 있습니다.
            이 경우에는 변경된 상품 또는 용역의 내용 및 제공일자를 명시하여
            현재의 상품 또는 용역의 내용을 게시한 곳에 즉시 공지합니다. 3.
            "몰"이 제공하기로 이용자와 계약을 체결한 서비스의 내용을 상품 등의
            품절 또는 기술적 사양의 변경 등의 사유로 변경할 경우에는 그 사유를
            이용자에게 통지 가능한 주소로 즉시 통지합니다. 4. 전항의 경우 "몰"은
            이로 인하여 이용자가 입은 손해를 배상합니다. 다만, "몰"이 고의 또는
            과실이 없음을 입증한 경우에는 아무런 책임을 부담하지 않습니다.
          </div>
          <br />
          <h3>제5조 서비스의 중단</h3>
          <div>
            1. "몰"은 컴퓨터 등 정보통신설비의 보수점검·교체 및 고장, 통신의
            두절 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할
            수 있습니다. 2. "몰"은 제1항의 사유로 "서비스"의 제공이 일시적으로
            중단됨으로 인하여 이용자 또는 제 3자가 입은 손해에 대하여
            배상합니다. 단 "몰"이 고의 또는 과실이 없음을 입증하는 경우에는
            그러하지 아니합니다. 3. 사업종목의 전환, 사업의 포기,업체 간의 통합
            등의 이유로 서비스를 제공할 수 없게 되는 경우에는 "몰"은 제 8조에
            정한 방법으로 이용자에게 통지하고 당초 "몰"에서 제시한 조건에 따라
            소비자에게 보상합니다. 다만,"몰"이 보상기준 등을 고지하지 아니한
            경우에는 이용자들의 마일리지 또는 적립금 등 "몰"에서 통용되는
            통화가치에 상응하는 현물 또는 현금으로 이용자에게 지급합니다.
          </div>
        </ProvisionBox>
      </Wrapper>
    </Container>
  );
}

export default provision;

const Container = styled.div`
  width: 100%;
  height: 93%;
  display: flex;
  justify-content: center;
  align-items: center;
  padding: 1rem;
`;

const Wrapper = styled.div`
  width: 100%;
  height: 100%;
  display: flex;
  justify-content: center;
  align-items: center;
  flex-direction: column;
  gap: 1.5rem;
`;

const ProvisionBox = styled.div`
  width: 100%;
  height: 100%;
  border: 1px solid #d4d4d4;
  padding: 1rem;
  overflow: scroll;
  border-radius: 1rem;
`;
